app/controllers/incidents_controller.rb

  def index
    @incidents = Incident.all
---
SELECT * FROM "incidents"

  def show
    @incident = Incident.find(params[:id])
---
SELECT * FROM "incidents" WHERE ("incidents"."id" = 1)

 def show_with_map
   @incident = Incident.find(params[:id])
---
SELECT * FROM "incidents" WHERE ("incidents"."id" = 1)

  def edit
    @incident = Incident.find(params[:id])
---
SELECT * FROM "incidents" WHERE ("incidents"."id" = 4)

  def create
    @incident = Incident.new(params[:incident])

    respond_to do |format|
      if @incident.save
---
INSERT INTO "incidents" ("latitude", "updated_at", "title", "mountain", "description", "longitude", "when", "created_at") VALUES(35.687006, '2011-09-19 11:48:04', '"Those high wakeful plains."', 'Mount Methton', 'Paint it brown. Hound.', -105.93819, '2007-05-19 05:45:00', '2011-09-19 11:48:04')

  def update
    @incident = Incident.find(params[:id])

    respond_to do |format|
      if @incident.update_attributes(params[:incident])
---
SELECT * FROM "incidents" WHERE ("incidents"."id" = 4)
UPDATE "incidents" SET "description" = 'Bjork was here. Maybe.', "updated_at" = '2011-09-20 06:45:26' WHERE "id" = 4